# Intro to Pandas

## Data Frames

#### Basic Imports

In [6]:
# Basic imports
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

### Data Frame from dict

1. Create a Data Frame from dictionary below

In [2]:
# Setting the data for the df
data = {'Lisbon':[115,222,345,421], 'Rome':[231, 432, 489, 129], 'London':[654,543,632,233]}

In [1]:
# Create the df

### Data Frame  from numpy array

2. Use the numpy.randn() method and create a DF 5x5. Set the columns name = ('Z', 'Y', 'Z','W','T')

In [3]:
# Data from array
data =

In [4]:
# DF creation
np_df =

# show
np_df

###  Data Frame from excel 

From now we will continue to work on the "premier_league.xlsx" file

In [9]:
premier_df = pd.read_excel('../../Data/premier_league.xlsx')
premier_df

   Pos                     Team  Pld   W  D   L  GF  GA  GD  Pts
0    1         Manchester City    38  32  2   4  95  23  72   98
1    2                Liverpool   38  30  7   1  89  22  67   97
2    3                  Chelsea   38  21  9   8  63  39  24   72
3    4        Tottenham Hotspur   38  23  2  13  67  39  28   71
4    5                  Arsenal   38  21  7  10  73  51  22   70
5    6        Manchester United   38  19  9  10  65  54  11   66
6    7  Wolverhampton Wanderers   38  16  9  13  47  46   1   57
7    8                  Everton   38  15  9  14  54  46   8   54
8    9           Leicester City   38  15  7  16  51  48   3   52
9   10          West Ham United   38  15  7  16  52  55  −3   52

#### Data Frame description:
* **Pos:** Rank position
* **Team:** Team Name
* **Pld:** Games Played
* **W:** Games Won
* **D:** Games Drawn
* **L:** Games Lost
* **GF:** Goals For
* **GA:** Goals Against
* **GD:** Goals Difference
* **Pts:** Points

## Basic DF information

3. Print the info about the structure of the DF

In [10]:
# Info on the DF structure

#### Head and Tail
4. Print the first 4 rows of the df

In [11]:
# First 4 rows

5. Print the last 3 rows of the df

In [13]:
# Last 3 rows

6. Print the df index

In [14]:
# DF index

7. Print the column names

In [15]:
# Column names

8. Print the column **'Pts'**, **[ ]** method.

In [18]:
# Column

9. Print the columns **'Team','Pts'**, **[ ]** method.

In [21]:
# Columns

10. Print the column **'Pts'** from index 2 to 5

In [22]:
# Individual column combined with index

11. Print the column **'Pts'** with the specific index 1 and 7

In [23]:
# Specific index

#### Multiple data columns
12. Grab the columns **['Team','GF', 'GA','Pts']** using the following method

In [22]:
# Specific data columns
DataFrame()

                      Team  Pld  GF  GA
0         Manchester City    38  95  23
1                Liverpool   38  89  22
2                  Chelsea   38  63  39
3        Tottenham Hotspur   38  67  39
4                  Arsenal   38  73  51
5        Manchester United   38  65  54
6  Wolverhampton Wanderers   38  47  46
7                  Everton   38  54  46
8           Leicester City   38  51  48
9          West Ham United   38  52  55

13. Use the same method of Ex.12 and grab the same columns with index (2,4,6,8)

In [23]:
DataFrame()

      Team  Pts   W
2  Chelsea   72  21
4  Arsenal   70  21
7  Everton   54  15

### Grab rows

14. Print the row with index 5

In [24]:
#rows indexing

15. Grab rows from index 0 to 5

In [25]:
# Slicing rows

16. Grab rows with index 3,6,8

In [26]:
# Specific index rows

### Adding new column
17. Use the premier_df and add a new column **"Coach"**. Assign to the new column the value **"Ferguson"**

In [27]:
# New column

In [29]:
premier_df

   Pos                     Team  Pld   W  D   L  GF  GA  GD  Pts  Stadium
0    1         Manchester City    38  32  2   4  95  23  72   98  Wembley
1    2                Liverpool   38  30  7   1  89  22  67   97  Wembley
2    3                  Chelsea   38  21  9   8  63  39  24   72  Wembley
3    4        Tottenham Hotspur   38  23  2  13  67  39  28   71  Wembley
4    5                  Arsenal   38  21  7  10  73  51  22   70  Wembley
5    6        Manchester United   38  19  9  10  65  54  11   66  Wembley
6    7  Wolverhampton Wanderers   38  16  9  13  47  46   1   57  Wembley
7    8                  Everton   38  15  9  14  54  46   8   54  Wembley
8    9           Leicester City   38  15  7  16  51  48   3   52  Wembley
9   10          West Ham United   38  15  7  16  52  55  −3   52  Wembley

#### Adding Series to Data Frame

18. Given the following list **coach_data**, create a series **"coach_name""**, when you create the series specify the index where you want the coach names to match.

In [29]:
coach_data =['Mourinho', 'Ferguson', 'Conte','Ranieri']

In [ ]:
#Adding a Series to a DataFrame
coach_name = Series(data= ,index= )
coach_name

19. Add the coach_name series data to the 'coach' column

In [30]:
#Now input into the nfl DataFrame


#Show
premier_df

20. Delete the 'coach' column

In [32]:
# Delete columns


premier_df

## Congratulation you completed all the exercises!